export const MESSAGES = {
  ERROR: {
    ACCOUNT_DEACTIVATED: `Указанный аккаунт деактивирован`,
    EMPTY_AUTH_CODE: `Необходимо указать код подтверждения`,
    EMPTY_BIRTHDAY: `Необходимо указать дату рождения`,
    EMPTY_DATE: `Необходимо указать дату`,
    EMPTY_EMAIL: `Необходимо указать электронную почту`,
    EMPTY_FIELD: `Поле не заполнено`,
    EMPTY_LOGIN: `Необходимо указать логин`,
    EMPTY_NAME: `Необходимо указать имя`,
    EMPTY_PASSWORD: `Ошибка! Введите пароль`,
    EMPTY_PHONE: `Необходимо указать телефон`,
    EMPTY_REVIEW: `Отзыв не может быть пустым`,
    NO_DATA: `Данные для передачи отсутствуют`,
    NOT_SAVED: `Ошибка! Данные не были сохранены`,
    NOTHING_SELECTED: `Ошибка! Нужно выбрать хотя бы один вариант`,
    PERSONAL_DATA_AGREEMENT: `Нужно согласиться на&nbsp;обработку персональных данных`,
    SIMPLE: `Ошибка!`,
    WRONG_AUTH_CODE: `Код подтверждения указан некорректно`,
    WRONG_BIRTHDAY: `Ошибка! Дата дня рождения должна быть в&nbsp;виде дд.мм.гггг и&nbsp;раньше текущего дня`,
    WRONG_DATE: `Ошибка! Дата указана некорректно`,
    WRONG_EMAIL: `Почта указана некорректно`,
    WRONG_FIELD_INPUT: `Поле заполнено неверно`,
    WRONG_LOGIN: `Ошибка! Логин введён некорректно`,
    WRONG_PASSWORD: `Ошибка! Длина пароля должна быть не&nbsp;менее 6&nbsp;символов`,
    WRONG_PHONE: `Телефон указан некорректно`
  },
  INFO: {
    NO_CHANGES: `Вы не&nbsp;изменили данные`,
    WAIT: `Подождите...`
  },
  SUCCESS: {
    CALLBACK_REQUEST_RECEIVED: `Мы скоро вам перезвоним`,
    COPIED: `Скопировано`,
    REVIEW_RECEIVED: `Спасибо! Ваш отзыв получен и скоро будет добавлен на сайт`,
    SAVED: `Сохранено`
  }
}
